<template>
  <div class="menu">
    <div class="container">
      <div class="menu__wrapper">
        <div class="menu__categoryNow">
          {{ category === "all" ? "Все товары" : category }}
        </div>
        <div class="menu__carts">
          <Cart v-for="(product, i) in productsView" :key="i" :productProps="product" />
        </div>
        <Pagination v-show="products.length > 4" :lengthProps="products.length" />
      </div>
    </div>
  </div>
</template>

<script>
import "./style.scss";
import Cart from "@/components/Cart";
import Pagination from "@/components/Pagination";
export default {
  props: ['filterTitle'],
  data: () => ({
    category: "all",
    products: [
      {
        img: require("@/assets/img/products/123.png"),
        title: "Говядина",
        description:
          "Полутвердый пластичный однородный сыр, слегка ломкий на изгибе. Пажитник придает легкое ореховое послевкусие. В Италии считается столовым сыром, который подходит к любому времени суток и к любому блюду и к вину. Вес головки 500 г. +/-10%. Цена за 1 кг. Продукция компании Alpenville изготовлена преимущественно из Шарангского молока",
        previewText:
          "Полутвердый пластичный однородный сыр, слегка ломкий на изгибе. Пажитник придает легкое ореховое послевкусие. В Италии считается столовым сыром, который подходит к любому времени суток и к любому блюду и к вину",
        rating: 4,
        price: 1000,
        weigth: 500,
        category: "мясное",
        reviews: [
          {
            user: "123",
            text:
              "Заказал 5кг мяса, живу в Московской области. Как и обещал оператор, привезли через 1,5 часа. Свежее, как будто было живое еще по дороге. Действительно натуральные продукты. Я обязательно буду заказывать дальше. А теперь подробнее о плюсах и минусах всего магази...",
          },
        ],
      },
      {
        img: require("@/assets/img/products/123.png"),
        title: "Телятина",
        description:
          "Полутвердый пластичный однородный сыр, слегка ломкий на изгибе. Пажитник придает легкое ореховое послевкусие. В Италии считается столовым сыром, который подходит к любому времени суток и к любому блюду и к вину. Вес головки 500 г. +/-10%. Цена за 1 кг. Продукция компании Alpenville изготовлена преимущественно из Шарангского молока",
        previewText:
          "Полутвердый пластичный однородный сыр, слегка ломкий на изгибе. Пажитник придает легкое ореховое послевкусие. В Италии считается столовым сыром, который подходит к любому времени суток и к любому блюду и к вину",
        rating: 4,
        price: 1000,
        weigth: 500,
        category: "мясное",
        reviews: [
          {
            user: "123",
            text:
              "Заказал 5кг мяса, живу в Московской области. Как и обещал оператор, привезли через 1,5 часа. Свежее, как будто было живое еще по дороге. Действительно натуральные продукты. Я обязательно буду заказывать дальше. А теперь подробнее о плюсах и минусах всего магази...",
          },
        ],
      },
      {
        img: require("@/assets/img/products/123.png"),
        title: "Курица",
        description:
          "Полутвердый пластичный однородный сыр, слегка ломкий на изгибе. Пажитник придает легкое ореховое послевкусие. В Италии считается столовым сыром, который подходит к любому времени суток и к любому блюду и к вину. Вес головки 500 г. +/-10%. Цена за 1 кг. Продукция компании Alpenville изготовлена преимущественно из Шарангского молока",
        previewText:
          "Полутвердый пластичный однородный сыр, слегка ломкий на изгибе. Пажитник придает легкое ореховое послевкусие. В Италии считается столовым сыром, который подходит к любому времени суток и к любому блюду и к вину",
        rating: 4,
        price: 1000,
        weigth: 500,
        category: "мясное",
        reviews: [
          {
            user: "123",
            text:
              "Заказал 5кг мяса, живу в Московской области. Как и обещал оператор, привезли через 1,5 часа. Свежее, как будто было живое еще по дороге. Действительно натуральные продукты. Я обязательно буду заказывать дальше. А теперь подробнее о плюсах и минусах всего магази...",
          },
        ],
      },
      {
        img: require("@/assets/img/products/123.png"),
        title: "Баранина",
        description:
          "Полутвердый пластичный однородный сыр, слегка ломкий на изгибе. Пажитник придает легкое ореховое послевкусие. В Италии считается столовым сыром, который подходит к любому времени суток и к любому блюду и к вину. Вес головки 500 г. +/-10%. Цена за 1 кг. Продукция компании Alpenville изготовлена преимущественно из Шарангского молока",
        previewText:
          "Полутвердый пластичный однородный сыр, слегка ломкий на изгибе. Пажитник придает легкое ореховое послевкусие. В Италии считается столовым сыром, который подходит к любому времени суток и к любому блюду и к вину",
        rating: 4,
        price: 1000,
        weigth: 500,
        category: "мясное",
        reviews: [
          {
            user: "123",
            text:
              "Заказал 5кг мяса, живу в Московской области. Как и обещал оператор, привезли через 1,5 часа. Свежее, как будто было живое еще по дороге. Действительно натуральные продукты. Я обязательно буду заказывать дальше. А теперь подробнее о плюсах и минусах всего магази...",
          },
        ],
      },
    ]
  }),
  components: {
    Cart,
    Pagination,
  },
  computed: {
    productsView() {
      if (this.category === "all") {
        return this.products;
      } else {
        const productView = this.products.filter(
          (product) => product.category.toLowerCase() === this.category.toLowerCase()
        );
        return productView;
      }
    },
  },
  watch: {
    filterTitle: function (newVal, oldVal) {
      this.category = newVal;
      this.productsView;
    }
  },
  mounted() {
    if(this.$route.params.category) {
      this.category = this.$route.params.category;
    }
  }

};
</script>
