<template>
  <div class="paymentPage">
    <div class="container">
      <div class="paymentPage__wrapper">
        <h2 class="paymentPage__title">{{title}}</h2>
        <div class="paymentPage__text">
          Нашим гостям мы предлагаем жаркую парилку, разогретую до оптимального температурного режима и душистые веники. Благодаря правильному проектированию помещений русской бани в Домодедово, наш легкий пар не жжет кожу и не оставляет после себя головную боль. В банный комплекс входят: русская баня на дровах,  оздоровительные SPA-процедуры, хаммам, бассейн и караоке. Для Вашего удобства в составе нашего комплекса имеется  уютный зал, где Вы можете расслабиться и сделать  заказ из нашего меню. Банный комплексе De’Lore  рассчитан на одновременное посещение 25 человек.
          <br><br>
          Нашим гостям мы предлагаем жаркую парилку, разогретую до оптимального температурного режима и душистые веники. Благодаря правильному проектированию помещений русской бани в Домодедово, наш легкий пар не жжет кожу и не оставляет после себя головную боль. В банный комплекс входят: русская баня на дровах,  оздоровительные SPA-процедуры, хаммам, бассейн и караоке. Для Вашего удобства в составе нашего комплекса имеется  уютный зал, где Вы можете расслабиться и сделать  заказ из нашего меню. Банный комплексе De’Lore  рассчитан на одновременное посещение 25 человек.
        </div>
        <div class="paymentPage__buttons">
          <router-link class="paymentPage__mane" to="menu">В каталог</router-link>
          <router-link class="paymentPage__payment" to="delivery">
            О доставке
            <svg width="20" height="15" viewBox="0 0 20 15" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M19.6544 8.31666C20.0159 7.95516 20.0159 7.36906 19.6544 7.00756L13.7634 1.11659C13.4019 0.755096 12.8158 0.755096 12.4543 1.11659C12.0928 1.47809 12.0928 2.0642 12.4543 2.4257L17.6907 7.66211L12.4543 12.8985C12.0928 13.26 12.0928 13.8461 12.4543 14.2076C12.8158 14.5691 13.4019 14.5691 13.7634 14.2076L19.6544 8.31666ZM0.486328 8.58779L18.9998 8.58779L18.9998 6.73644L0.486328 6.73643L0.486328 8.58779Z" fill="#00AC4E"/>
            </svg>
          </router-link>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import './style.scss';
export default {
  name: 'payment',
  data: () => ({
    title: 'Оплата'
  }),
  head() {
    return {
      title: `Пиросмани - ${this.title}`
    }
  }
}
</script>
